In [1]:
import numpy as np

In [2]:
10 * np.array([1,2,3,4])

array([10, 20, 30, 40])

In [3]:
import pandas as pd
from io import StringIO

data = """
name,last_name,color,age
john,doe,green,10
peter,smith,red,20
carl,marx,blue,30
"""

In [4]:
df = pd.read_csv(StringIO(data))
df

    name last_name  color  age
0   john       doe  green   10
1  peter     smith    red   20
2   carl      marx   blue   30

In [5]:
df["age"] + 10

0    20
1    30
2    40
Name: age, dtype: int64

In [6]:
pd.get_dummies(df).astype(int)

,age,name_carl,name_john,name_peter,last_name_doe,last_name_marx,last_name_smith,color_blue,color_green,color_red
0,10,0,1,0,1,0,0,0,1,0
1,20,0,0,1,0,0,1,0,0,1
2,30,1,0,0,0,1,0,1,0,0